
LEXICON_SRC_RU: dict[str, str] = {
    '/start': 'Всё,что вы хотели знать о лазерной эпиляции или сразу задайте вопрос👇🏽'
}

LEXICON_SRC_COMMANDS_RU: dict[str, str] = {
    '/1': 'Лазерная эпиляция',
    '/2': 'RF-лифтинг',
    '/3': 'Консультация 📞'
}

LEXICON_SRC_HI_RU: dict[str, str] = {
    '/1': '<b>Информация о лазерной эпиляции диодным лазером Lumenis</b>👇🏽\n\n'
          ''
    ,

}

LEXICON_SRC_COMMANDS_RU_TEST: dict[str, str] = {
    '/1t': '1️⃣ Описание',
    '/2t': '2️⃣ Стоимость курса',
    '/3t': '3️⃣ Противопоказания',
}

LEXICON_SRC_COMMANDS_RU_UPR: dict[str, str] = {
    '/1u': '1️⃣ Описание',
    '/2u': '2️⃣ Противопоказания',
    '/3u': '3️⃣ Как подготовиться',
    '/4u': '4️⃣ Преимущество'
}

LEXICON_SRC_HI_RU_TEST: dict[str, str] = {
    '/1t': '<b>RF лифтинг лица.</b>\n\n'
           'Омолаживающая методика, позволяющая добиться уплотнения тургора кожи за счет прогрева глубоких слоев кожи,'
           'при полном курсе позволяет добиться выработки коллагена и эластина. Имеет лимфодренахный эффект и убирает'
           'застоявшиеся отёки.'
           'RF лифтинг также является радиоволновой терапией, только'
           'его воздействие направлено не на жировые отложения, а на глубокие слои кожи.'
           'Рекомендуется курсовое применение 8-10 процедур в зависимости от возрастных изменений 1 раз в неделю'
           '(промежуток не должен превышать 10 дней). 1 курс-1 раз в 6 месяцев. Стойкий эффект после курса 4-5 месяцев.'
           'после консультации со специалистом подбирается длительность курса. \n\n'
           '<b>Что вы получаете после курса процедур:</b>\n\n'
           '● Уплотнение кожи(дермы) \n\n'
           '● Выравнивание цвета кожи(за счёт проработки лимфосистемы) \n\n'
           '● Уходит застоявшаяся отёчность(за счёт улучшения работы сосудов) \n\n'
           '● Сужаются поры(за счёт прогрева дермы) \n\n',
    '/2t': '<b>Стоимость одной процедуры 1500 рублей. Рекомендуется пройти курс из 8-10 процедур,</b> \n\n'
           'Длительность курса зависит от возраста и состояния кожи. Определяется специалистом.',
    '/3t': '<b>Противопоказания к процедуре.</b> \n\n'
           '● в период беременности и лактации\n\n'
           '● во время инфекционного процесса\n\n'
           '● при обострении соматических болезней\n\n'
           '● при наличии новообразований разного генеза\n\n'
           '● в случае эндокринных патологий\n\n'
           '● при диагностике проблем с сосудами, системой свертываемости крови\n\n'
           '● при развитии атеросклеротических изменений\n\n'
           '● в возрасте до 18\n\n',

}

LEXICON_SRC_HI_RU_INFO: dict[str, str] = {
    '/1u': '<b>Описание технологии лазерной эпиляции ✅</b> \n\n'   # описание
           'Лазерные диодные системы LightSheer от компании Lumenis (США) широко применяются на всех фототипах'
           ' кожи (I-VI) без исключений. Процедура лазерной эпиляции проходит быстро, безболезненно.'
           'Диодный лазер LightSheer прекрасно работает на генетически темной коже IV- VI фототипов и на сильно '
           'загорелой коже, что раньше считалось невозможным. Это единственный лазер с уникальной и специальной '
           'технологией обезболивания, повышенной эффективности и безопасности для темных типов кожи.'
           'Насадка LightSheer ET с размером пятна 9 х 9 мм, плотностью до 100 Дж/см2 и шириной импульса до 400 мс '
           'использует технологии непрерывного контактного сапфирового охлаждения ChillTip, то делает процедуру '
           'комфортной даже на смуглой коже.'
           'Лазерная эпиляция диодным лазером основана на принципе селективного фототермолиза. Это вызывает поглощение '
           'лазерного луча определенной длины волны хромофорами в организме человека. В случае эпиляции фотоакцептором,'
           'поглощающим его излучение, является меланин. Меланин избирательно поглощает энергию, что приводит к '
           'термическому повреждению структур волос, отвечающих за их рост, без повреждения прилегающих тканей.'
           'Диодный лазер излучает однородную волну, длиной 808 нм, которая поглощается меланином. Наилучший эффект '
           'эпиляции достигается у пациентов со светлой кожей и темными волосами. Чем светлее кожа и темнее и гуще '
           'волосы,'
           'тем безопаснее процедура, чем в случае более темной кожи. Лечение, проводимое специалистом, безопасно и '
           'не требует от пациента периода восстановления.'
           'Источник лучей у этого устройства - диоды. Косметолог может плавно отрегулировать длину волны лазера, '
           'благодаря'
           'чему он может гибко адаптироваться к потребностям клиента. В случае дискомфорта или боли во время процедуры'
           ' специалист, проводящий эпиляцию, меняет длину волны.'
           'Световая энергия может проникать в кожу на глубину 2 мм, что делает аппарат безопасным для структур кожной '
           'ткани, расположенных в непосредственной близости от волосяного фолликула. Его используют при эпиляции '
           'различных участков тела: лицо, шея, подмышки, зона бикини, живот и грудь. Эффективность процедуры с '
           'использованием диодных лазеров максимальна, плавность высокая, а комфорт повышен. \n\n'
           'Механизм действия диодного аппарата заключается в следующем: пигмент меланин содержащийся в волосе, '
           'поглощает световую энергию лазера, что и приводит к его уничтожению. Необходимо учитывать, что за один '
           'сеанс ни один аппарат не сможет уничтожить все луковицы. Потому, что волосы проходят три стадии роста: '
           'анаген (фаза активного роста), катагент (переходная фаза) и телоген (стадия покоя). За один сеанс '
           'уничтожаются только луковицы, находящиеся в активной стадии (примерно 30% волос). Волосы, находящиеся '
           'на момент процедуры в «спящей» фазе, не поддаются воздействию энергии, поэтому для стойкого результата '
           'потребуется серия процедур. \n\n'
           '<b>Обязательно проконсультируйтесь со специалистом ❗</b>',

    '/2u': '<b>Противопоказания к лазерной эпиляции ⛔</b>\n\n'  # противопоказания
           '● Беременность, лактация  \n\n'
           '● Эпилепсия  \n\n'
           '● Возраст до 18 лет только с согласия родителей  \n\n'
           '● Повреждение кожи, воспаления, пигментные образования, келоидные рубцы, кожные заболевания в месте '
           'эпиляции  \n\n'
           '● Татуировки в месте эпиляции  \n\n'
           '● Обострение хронических заболеваний \n\n'
           '● Тепловая крапивница \n\n'
           '● Герпес в стадии обострения \n\n'
           '● Онкология в анамнезе \n\n'
           '● Аутоиммунные заболевания соединительной ткани \n\n'
           '● Гормональный дисбаланс, который сопровождается патологическим ростом волос \n\n'
           '● Чрезмерно загорелая кожа \n\n'
           '● Прием тетрациклиновой группы антибиотиков, сульфаниламидов, препаратов на основе золота или системных '
           'ретиноидов \n\n'
           '● Светлый цвет волос,ненасыщенных меланином',

    '/3u': '<b>Подготовка к процедуре ✂</b>\n\n'  # как подготовиться
           '● Воздержаться от загара и похода в солярий как минимум за две недели до процедуры🗝️ \n\n '
           '● Отказаться от других способов эпиляции, травмирующих фолликул волоса (например, ваксинг и шугаринг) \n\n'
           '● Сбрить волосы за сутки перед процедурой лазерной эпиляции,не надавливая сильно станком на кожу. '
           'Это поможет аппарату более эффективно воздействовать на фолликулы \n\n'
           '● Не следует использовать перед процедурой на обрабатываемой области дезодоранты, масла, кремы и спиртовые '
           'лосьоны. Из-за слоя косметических средств специальный состав, который специалист наносит на кожу перед '
           'процедурой, может не подействовать или вступить в незапланированную реакцию с нанесенными ранее на кожу '
           'продуктами \n\n'
           '● Не следует проводить процедуру во время приема антибиотиков тетрациклиновой группы \n\n'
           '● Не рекомендуется использовать средства для автозагара в течение 7 – 10 дней до сеанса '
           '(они содержат пигмент, который может снизить эффективность процедуры \n\n'
           '● При желании за 1 час до процедуры можно нанести обезболивающий крем под плёнку'
           '(посоветуйтесь со специалистом на консультации \n\n'
           '● Воздержаться от посещения бассейна (он содержит хлор, который может вызвать раздражение кожи), '
           'бань и саун (перегрев после процедуры лазерной эпиляции может негативно сказаться на коже) \n\n',

    '/4u': '<b>Преимущества лазерной эпиляции</b>🗝️ \n\n'  # преимущество
           '● Безболезненная процедура во время лазерных вспышек \n\n'
           '● Длительный гладкий эффект \n\n'
           '● Плюсы лазерной эпиляции, заключаются в том, что после процедуры не возникает чувство сухости и '
           'стянутости \n\n'
           '● Не нарушается кожный покров \n\n'
           '● Растительность не врастает в кожный покров \n\n'
           '● Лазерная эпиляция разрушает волосяные фолликулы активно растущих волос. Этим фолликулам трудно '
           'восстановиться на большинстве частей тела, таких как подмышки, бикини или голени. Поэтому многие пациенты '
           'наблюдают долгосрочные результаты или значительное сокращение роста волос.'
           'Одна процедура не даст должного результата, так как в первый раз лазер удаляет только от 60% активно '
           'растущих волос. '
           'Для полного выпадения волосяных фолликулов необходимо, чтобы они находились в стадии роста, иначе волосы '
           'будут продолжать расти. Поэтому вам может понадобиться восемь или более сеансов, чтобы воздействовать на '
           'все волосяные фолликулы, пока они находятся в стадии роста. Результат во многом зависит от гормонального'
           ' фона пациента. Сапфировое охлаждене является неоспоримым преимуществом перед другими систеами.'
           'Так же важно не путать технологию ллазерной эпиляции с китайскими фотоэпиляторами. Частота проведения '
           'процедур-1 раз в 2 месяца. \n\n',

}
